<?php
/*---------------------------------------------------------------------------
* @Module Name: MySearch
* @Module Id: ls_mysearch
* @Module URI: http://livestreet.ru/addons/74/
* @Description: Simple Search via MySQL (without Sphinx) for LiveStreet
* @Version: 1.1.34
* @Author: aVadim
* @Author URI: 
* @LiveStreet Version: 0.3.1
* @File Name: config.php
* @License: GNU GPL v2, http://www.gnu.org/licenses/old-licenses/gpl-2.0.html
*----------------------------------------------------------------------------
*/

define('MYSEARCH_VERSION', '1.1');

/***
 * Разрешение перехвата экшена на поиск. 
 * Установка значения в false позволяет временно отключать поиск без 
 * удаления модуля
 */
define('MYSEARCH_HOOK_ENABLE', true);

/***
 * Основа шаблона для определения слов
 * Слово - это набор букв, цифр, знаков "подчеркивание" и "минус"
 * 
 * Шаблон служит для фильтрации "небукв" на этапе подготовки к поиску
 * и для выделения слов в "подсветке"
 * 
 * Для поддержки многоязычности в этом шаблоне заданы символы алфавитов
 * практически всех языков народов стран Европы и бывш. СССР.
 * При желании можно добавить любой другой - китайский, хинди, суахили и т.д.
 * Для этого добавляется (или заменяется) диапазон символов в кодах Unicode.
 */
define('MYSEARCH_CHAR_PATTERN', '[\d\w\x{00c0}-\x{024f}\x{0386}-\x{052f}\x{0530}-\x{058F}_-]');

/***
 * Поиск строгий/нестрогий
 * false - нестрогий поиск, т.е. запрос "дом" вернет "дома", "задом" и т.д.
 * true  - строгий поиск, т.е. запрос "дом" будет игнорировать "дома" и "задом",
 *         но запросу "дом*" будут соответствовать "дома", "домовой", 
 *         а запросу "*дом" будут соответствовать "задом", "передом",
 *         а запросу "*дом*" будет соответствовать "рандомный"
 */
define('MYSEARCH_STRICT', true);

/***
 * Минимальная и максимальная длина искомого выражения.
 * Не рекомендуется минимальное значение задавать меньше 3
 * Не рекомендуется максимальное значение задавать больше 255
 */
define('MYSEARCH_MIN_LENGTH', 3);
define('MYSEARCH_MAX_LENGTH', 255);

/***
 * Режим вывода результатов поиска
 * 1 - Краткий текст
 * 2 - Полный текст
 * 3 - Сниппет
 */
define('MYSEARCH_OUT_TEXT_SHORT', 1);
define('MYSEARCH_OUT_TEXT_FULL', 2);
define('MYSEARCH_OUT_TEXT_SNIPPET', 3);

define('MYSEARCH_OUT_MODE', MYSEARCH_OUT_TEXT_SNIPPET); // Задаем режим вывода результатов

/***
 * Длина сниппета. Реальный размер может быть и больше,
 * учитывая, что будет выравнивание до границ слова пв начале и конце сниппета
 */
define('MYSEARCH_SNIPPET_LENGTH', 160);

/***
 * Максимальная длина сниппета. Если сниппет с учетом выравнивания по границам слов
 * становится больше этого параметра, то он будет обрезаться принудительно
 * Если = 0, то игнорируется
 */
define('MYSEARCH_SNIPPET_MAXLENGTH', 220);

/***
 * Строки, которые будут вставляться в тексте до и после искомых строк,
 * например, чтобы "подсветить" найденный текст
 */
define('MYSEARCH_SNIPPET_BEFORE_MATCH', '<span class="searched-item">');
define('MYSEARCH_SNIPPET_AFTER_MATCH', '</span>');

/***
 * Строки, которые будут вставляться в тексте до и после фрагмента с искомыми строками,
 * например, чтобы разбить их на параграфы
 */
define('MYSEARCH_SNIPPET_BEFORE_FRAGMENT', '<p>');
define('MYSEARCH_SNIPPET_AFTER_FRAGMENT', '</p>');

/***
 * Максимальное число фрагментов, которое будет показано в сниппете
 * Если = 0, то игнорируется
 */
define('MYSEARCH_SNIPPET_MAX_FRAGMENTS', 5);

/***
 * Пропускать теги
 * Если задано, то в тегах поиск все равно будет осуществляться,
 * но в результатах поиска все теги будут удаляться. Поэтому
 * если искомое слово встречается только в теге, то топик будет
 * выведен, но слово подсвечено не будет
 */
define('MYSEARCH_SKIP_ALL_TAGS', false);

/***
 * ВНИМАНИЕ!
 *
 * Функционал, описанный ниже доступен только если установлена Админпанель 
 * версии 1.2.95 и выше. Иначе эти настройки просто игнорируются и 
 * протоколирование запросов не ведется
 */
 
/***
 * Протоколирование запросов поиска на сайте. 
 *   true - протоколирование включено
 *   true - протоколирование включено
 */
define('MYSEARCH_LOGS_ENABLE', false);

/***
 * Имя файла для протоколирования запросов. Если протоколирование включено,
 * то файл протокола будет сохраняться в папке logs Вашего сайта
 */
define('MYSEARCH_LOGS_FILE', 'mysearch.log'); 

/***
 * Максимальный размер лог-файла; если = 0, то ротация по дате
 * 
 * Например, 
 *   define('LOGS_MAX_SIZE', 1024*1024*1000); // Размер файла 1 Гб
 */
//define('LOGS_MAX_SIZE', 1024*1024*1000);	// 
define('MYSEARCH_LOGS_MAX_SIZE', 0); 

/***
 * Максимальное число лог-файлов
 * 
 * Например, если имя файла задано mysearch.log, то старые файлы
 * будут сохраняться под именами 
 *   mysearch1.log
 *   mysearch2.log
 *   mysearch3.log
 *   mysearch4.log
 *   ... и т.д. 
 */
define('MYSEARCH_LOGS_MAX_FILES', 10); 
